# todo:  Даны три переменные: X, Y, Z. Их значения числа.
# Из данных произвольных чисел выбрать наибольшее.

# Пример:
# X = 5
# Y = 10
# Z = 3
# Ответ: Наибольшее число 10.
#
# X = 10
# Y = 12
# Z = -7
# Ответ: Наибольшее число 12.


x = 5
y = 10
z = 3
#print('Max =', max(z, y, z))
if x > y and z:
    print("Наибольшее число х: ", х)
elif y > x and z:
    print("Наибольшее число y: ", y)
else:
    print("Наибольшее число z: ", z)


x = 10
y = 12
z = -7
#print('Min =', min(x, y, z))
if x > y and z:
    print("Наибольшее число х: ", х)
elif y > x and z:
    print("Наибольшее число y: ", y)
else:
    print("Наибольшее число z: ", z)